In [51]:
import pandas as pd

In [52]:
df1 = pd.read_excel("datasets/Aracaju.xlsx")
df2 = pd.read_excel("datasets/Fortaleza.xlsx")
df3 = pd.read_excel("datasets/Natal.xlsx")
df4 = pd.read_excel("datasets/Recife.xlsx")
df5 = pd.read_excel("datasets/Salvador.xlsx")

In [53]:
df = pd.concat([df1, df2, df3, df4, df5])

In [54]:
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [55]:
df.columns

Index(['Cidade', 'Data', 'Vendas', 'LojaID', 'Qtde'], dtype='object')

In [56]:
df['Cidade'].unique()

array(['Aracaju', 'Fortaleza', 'Natal', 'Recife', 'Salvador'],
      dtype=object)

In [57]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [58]:
#mudando o tipo de dado de uma coluna
df['LojaID'] = df['LojaID'].astype('object')

In [59]:
#pegando amostras
df.sample(5)

       Cidade       Data  Vendas LojaID  Qtde
102     Natal 2019-01-02   40.84   1034     3
178  Salvador 2019-01-02   39.28   1037     3
235  Salvador 2019-01-03   41.84   1034     1
95      Natal 2019-01-02    5.13   1035     1
151     Natal 2019-01-02   14.63   1035     1

In [60]:
#consultando valores nulos
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [61]:
#substituindo valores nulos pela m√©dia
df['Vendas'].fillna(df['Vendas'].mean(), inplace=True)

In [62]:
#substituindo valores nulos por zero
df['Vendas'].fillna(0, inplace=True)

In [63]:
#apagando linhas com valores nulos
df.dropna(inplace=True)

In [64]:
#apagando linhas com valores nulos com base em uma coluna
df.dropna(subset=['Vendas'], inplace=True)

In [65]:
#removendo linhas que estejam com valores faltantes em todas as colunas
df.dropna(how='all', inplace=True)

In [66]:
#criando colunas novas
df['Receita'] = df['Vendas'].mul(df['Qtde'])

In [67]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita
0  Aracaju 2018-01-01  142.00   1520     1   142.00
1  Aracaju 2018-01-01   14.21   1522     6    85.26
2  Aracaju 2018-01-01   71.55   1520     1    71.55
3  Aracaju 2018-01-01    3.01   1521     7    21.07
4  Aracaju 2018-01-01   24.51   1522     8   196.08

In [68]:
df['Receita'].max()

3544.0

In [69]:
df['Receita'].min()

3.34

In [70]:
#nlargest - retorna os n maiores valores de uma coluna
df.nlargest(3, 'Receita')

   Cidade       Data  Vendas LojaID  Qtde  Receita
7   Natal 2019-03-18   886.0    853     4   3544.0
51  Natal 2018-01-21   859.0    852     4   3436.0
55  Natal 2019-01-08   859.0    854     4   3436.0

In [71]:
#nsmallest - retorna os n menores valores de uma coluna
df.nsmallest(3, 'Receita')

      Cidade       Data  Vendas LojaID  Qtde  Receita
118  Aracaju 2018-01-01    3.34   1522     1     3.34
65    Recife 2019-01-01    4.01    981     1     4.01
92     Natal 2019-01-02    4.57   1035     1     4.57

In [72]:
#agrupamento por cidade
df.groupby('Cidade')['Receita'].sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [73]:
df.groupby('Cidade')['Receita'].nsmallest(3)

Cidade
Aracaju    118     3.34
           102     7.29
           8      12.16
Fortaleza  81     10.68
           92     13.96
           34     15.50
Natal      92      4.57
           95      5.13
           161     5.80
Recife     65      4.01
           1      11.44
           15     14.90
Salvador   92      4.57
           95      5.13
           161     5.80
Name: Receita, dtype: float64

In [74]:
df.groupby('Cidade')['Receita'].nlargest(3)

Cidade
Aracaju    41     1837.12
           94     1784.16
           23     1662.50
Fortaleza  141    1462.00
           69     1299.90
           27     1274.22
Natal      7      3544.00
           51     3436.00
           55     3436.00
Recife     46     1913.36
           141    1462.00
           19     1396.01
Salvador   127     721.83
           155     713.43
           98      695.28
Name: Receita, dtype: float64

In [75]:
df.sort_values('Receita', ascending=False).head(10)

   Cidade       Data  Vendas LojaID  Qtde  Receita
7   Natal 2019-03-18   886.0    853     4   3544.0
55  Natal 2019-01-08   859.0    854     4   3436.0
51  Natal 2018-01-21   859.0    852     4   3436.0
30  Natal 2018-10-02   856.0    853     4   3424.0
41  Natal 2018-05-20   835.0    852     4   3340.0
38  Natal 2018-02-25   828.0    852     4   3312.0
10  Natal 2018-10-27   828.0    852     4   3312.0
69  Natal 2019-03-24   817.0    852     4   3268.0
62  Natal 2018-02-10   793.0    854     4   3172.0
52  Natal 2018-04-27   778.0    854     4   3112.0

In [76]:
df["Data"] = df["Data"].astype("int64")

In [77]:
df.dtypes

Cidade      object
Data         int64
Vendas     float64
LojaID      object
Qtde         int64
Receita    float64
dtype: object

In [78]:
#passa para o formato de data
df["Data"] = pd.to_datetime(df["Data"])

In [79]:
df.dtypes

Cidade             object
Data       datetime64[ns]
Vendas            float64
LojaID             object
Qtde                int64
Receita           float64
dtype: object

In [80]:
df.groupby(df["Data"].dt.month)["Receita"].sum()

Data
1     188456.50
2      37244.47
3      67794.01
4      13586.00
5       8965.00
6       7097.00
7       4462.00
8       1212.00
9       5984.00
10      9680.00
11      1126.00
12       816.00
Name: Receita, dtype: float64

In [81]:
df['Ano venda'] = df['Data'].dt.year

In [87]:
df.sample(5)

       Cidade       Data  Vendas LojaID  Qtde  Receita  Ano venda
210     Natal 2019-01-02  197.64   1035     1   197.64       2019
49      Natal 2019-04-01  831.00    852     2  1662.00       2019
123   Aracaju 2018-01-01  115.19   1523     6   691.14       2018
56   Salvador 2019-01-01  178.44   1035     3   535.32       2019
236     Natal 2019-01-03  126.29   1035     3   378.87       2019

In [88]:
#Coluna de trimestre
df['Trimestre venda'] = df['Data'].dt.quarter

In [89]:
df.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Ano venda,Trimestre venda
39,Recife,2019-01-01,143.58,981,3,430.74,2019,1
69,Fortaleza,2019-01-01,216.65,1003,6,1299.90,2019,1
107,Recife,2019-01-01,15.40,980,7,107.80,2019,1
44,Salvador,2019-01-01,43.26,1037,2,86.52,2019,1
134,Salvador,2019-03-02,125.90,1036,1,125.90,2019,1

In [90]:
df.groupby(df['Trimestre venda'])['Receita'].sum()

Trimestre venda
1    293494.98
2     29648.00
3     11658.00
4     11622.00
Name: Receita, dtype: float64

In [91]:
#filtrando as vendas de 2019 do m√™s de mar√ßo
vendas_marco_19 = df.loc[(df['Data'].dt.year == 2019) & (df['Data'].dt.month == 3)]

In [92]:
vendas_marco_19

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Ano venda,Trimestre venda
108,Fortaleza,2019-03-02,152.89,981,4,611.56,2019,1
109,Fortaleza,2019-03-02,18.90,982,6,113.40,2019,1
110,Fortaleza,2019-03-02,51.98,983,6,311.88,2019,1
111,Fortaleza,2019-03-02,8.00,981,3,24.00,2019,1
112,Fortaleza,2019-03-02,133.59,982,1,133.59,2019,1
...,...,...,...,...,...,...,...,...
137,Salvador,2019-03-02,51.66,1036,3,154.98,2019,1
138,Salvador,2019-03-02,212.03,1037,3,636.09,2019,1
139,Salvador,2019-03-02,169.01,1036,1,169.01,2019,1
140,Salvador,2019-03-02,20.79,1036,2,41.58,2019,1
141,Salvador,2019-03-02,9.08,1036,1,9.08,2019,1